In [181]:
import pyspark
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("Jupyter Notebook").getOrCreate()
spark
from pyspark.sql.functions import sum, avg, col, substring, regexp_replace, col, lit

Importing a file
df_csv = spark.read.csv("path/to/your/file.csv", header=True, inferSchema=True)
df_json = spark.read.json("path/to/your/file.json")
df_parquet = spark.read.parquet("path/to/your/file.parquet")
df_orc = spark.read.orc("path/to/your/file.orc")

In [119]:
odf = spark.read.csv("C:/Users/erick/OneDrive/Desktop/python_work/pandas/Incomplete/bigmac.csv", header=True, inferSchema=True) #same as above but shorter and preferred
odf.show()

+----------+--------------+-------------------+
|      Date|       Country|Price in US Dollars|
+----------+--------------+-------------------+
|2000-04-01|     Argentina|                2.5|
|2000-04-01|     Australia|        1.541666667|
|2000-04-01|        Brazil|        1.648044693|
|2000-04-01|        Canada|         1.93877551|
|2000-04-01|   Switzerland|        3.470588235|
|2000-04-01|         Chile|        2.451361868|
|2000-04-01|         China|        1.195652174|
|2000-04-01|Czech Republic|        1.390537084|
|2000-04-01|       Denmark|        3.078358209|
|2000-04-01|     Euro area|             2.3808|
|2000-04-01|       Britain|        3.002000002|
|2000-04-01|     Hong Kong|        1.309370988|
|2000-04-01|       Hungary|        1.215053763|
|2000-04-01|     Indonesia|        1.825047199|
|2000-04-01|        Israel|        3.580246914|
|2000-04-01|         Japan|        2.773584906|
|2000-04-01|   South Korea|        2.707581227|
|2000-04-01|        Mexico|        2.221041445|
|2000-04-01|      Malaysia|        1.189473684|
|2000-04-01|   New Zealand|        1.691542289|
+----------+--------------+-------------------+
only showing top 20 rows

In [83]:
odf.printSchema()
odf.dtypes
odf.columns

root
 |-- Date: date (nullable = true)
 |-- Country: string (nullable = true)
 |-- Price in US Dollars: double (nullable = true)

['Date', 'Country', 'Price in US Dollars']

In [84]:
odf.select("Country","Price in US Dollars").show() # select two columns from big mac df

+--------------+-------------------+
|       Country|Price in US Dollars|
+--------------+-------------------+
|     Argentina|                2.5|
|     Australia|        1.541666667|
|        Brazil|        1.648044693|
|        Canada|         1.93877551|
|   Switzerland|        3.470588235|
|         Chile|        2.451361868|
|         China|        1.195652174|
|Czech Republic|        1.390537084|
|       Denmark|        3.078358209|
|     Euro area|             2.3808|
|       Britain|        3.002000002|
|     Hong Kong|        1.309370988|
|       Hungary|        1.215053763|
|     Indonesia|        1.825047199|
|        Israel|        3.580246914|
|         Japan|        2.773584906|
|   South Korea|        2.707581227|
|        Mexico|        2.221041445|
|      Malaysia|        1.189473684|
|   New Zealand|        1.691542289|
+--------------+-------------------+
only showing top 20 rows

In [107]:
odf.filter(col("Country") == "Britain").show() #when filtering, col is used to define what we are filtering on

+----------+-------+-------------------+----+
|      Date|Country|Price in US Dollars|year|
+----------+-------+-------------------+----+
|2000-04-01|Britain|        3.002000002|2000|
|2001-04-01|Britain|        2.845700001|2001|
|2002-04-01|Britain|        2.885500002|2002|
|2003-04-01|Britain|        3.144200002|2003|
|2004-05-01|Britain|        3.365199999|2004|
|2005-06-01|Britain|        3.440400003|2005|
|2006-01-01|Britain|        3.316131998|2006|
|2006-05-01|Britain|        3.647976002|2006|
|2007-01-01|Britain|           3.833731|2007|
|2007-06-01|Britain|        4.007163503|2007|
|2008-06-01|Britain|        4.570496503|2008|
|2009-07-01|Britain|        3.688274001|2009|
|2010-01-01|Britain|           3.671328|2010|
|2010-07-01|Britain|           3.483548|2010|
|2011-07-01|Britain|           3.891637|2011|
|2012-01-01|Britain|        3.823395002|2012|
|2012-07-01|Britain|          4.1623715|2012|
|2013-01-01|Britain|        4.248182498|2013|
|2013-07-01|Britain|        4.020070499|2013|
|2014-01-01|Britain|          4.6267965|2014|
+----------+-------+-------------------+----+
only showing top 20 rows

In [108]:
odf.select("Date", "Price in US Dollars").filter(col("Country") == "Britain").show() # select two columns and then filter on Britain

+----------+-------------------+
|      Date|Price in US Dollars|
+----------+-------------------+
|2000-04-01|        3.002000002|
|2001-04-01|        2.845700001|
|2002-04-01|        2.885500002|
|2003-04-01|        3.144200002|
|2004-05-01|        3.365199999|
|2005-06-01|        3.440400003|
|2006-01-01|        3.316131998|
|2006-05-01|        3.647976002|
|2007-01-01|           3.833731|
|2007-06-01|        4.007163503|
|2008-06-01|        4.570496503|
|2009-07-01|        3.688274001|
|2010-01-01|           3.671328|
|2010-07-01|           3.483548|
|2011-07-01|           3.891637|
|2012-01-01|        3.823395002|
|2012-07-01|          4.1623715|
|2013-01-01|        4.248182498|
|2013-07-01|        4.020070499|
|2014-01-01|          4.6267965|
+----------+-------------------+
only showing top 20 rows

In [101]:
odf = odf.withColumn("year", substring("Date",1,4)) #added year because we want to find the annual average
odf.show()

+----------+--------------+-------------------+----+
|      Date|       Country|Price in US Dollars|year|
+----------+--------------+-------------------+----+
|2000-04-01|     Argentina|                2.5|2000|
|2000-04-01|     Australia|        1.541666667|2000|
|2000-04-01|        Brazil|        1.648044693|2000|
|2000-04-01|        Canada|         1.93877551|2000|
|2000-04-01|   Switzerland|        3.470588235|2000|
|2000-04-01|         Chile|        2.451361868|2000|
|2000-04-01|         China|        1.195652174|2000|
|2000-04-01|Czech Republic|        1.390537084|2000|
|2000-04-01|       Denmark|        3.078358209|2000|
|2000-04-01|     Euro area|             2.3808|2000|
|2000-04-01|       Britain|        3.002000002|2000|
|2000-04-01|     Hong Kong|        1.309370988|2000|
|2000-04-01|       Hungary|        1.215053763|2000|
|2000-04-01|     Indonesia|        1.825047199|2000|
|2000-04-01|        Israel|        3.580246914|2000|
|2000-04-01|         Japan|        2.773584906|2000|
|2000-04-01|   South Korea|        2.707581227|2000|
|2000-04-01|        Mexico|        2.221041445|2000|
|2000-04-01|      Malaysia|        1.189473684|2000|
|2000-04-01|   New Zealand|        1.691542289|2000|
+----------+--------------+-------------------+----+
only showing top 20 rows

In [87]:
odf.printSchema()

root
 |-- Date: date (nullable = true)
 |-- Country: string (nullable = true)
 |-- Price in US Dollars: double (nullable = true)
 |-- year: string (nullable = true)

In [88]:
odf.groupBy("Country").count().show()

+-------------+-----+
|      Country|count|
+-------------+-----+
|       Russia|   33|
|       Sweden|   33|
|  Philippines|   32|
|     Malaysia|   33|
|    Singapore|   33|
|      Britain|   33|
|       Turkey|   31|
|       Jordan|    5|
|    Sri Lanka|   28|
|       Taiwan|   33|
|    Argentina|   33|
|        Qatar|    5|
|    Nicaragua|    5|
|         Peru|   30|
|        China|   33|
|United States|   33|
|        India|   19|
|       Kuwait|    5|
|        Chile|   33|
|      Croatia|    5|
+-------------+-----+
only showing top 20 rows

In [113]:
odf.filter(col("Price in US Dollars") > 3).groupBy("Year", "Country").agg(avg("Price in US Dollars").alias("Avg Price")).select("Country", "Year", "Avg Price").show()

+--------------+----+------------------+
|       Country|Year|         Avg Price|
+--------------+----+------------------+
|         Qatar|2019|3.4326419699999997|
|      Colombia|2008|       3.891807745|
|     Australia|2020|         4.5147975|
|        Israel|2000|       3.580246914|
|        Mexico|2008|       3.146973497|
|        Sweden|2010|      6.0354218025|
|Czech Republic|2012|      3.3947117625|
|  Saudi Arabia|2016|3.1979541295000002|
|      Thailand|2017|      3.4207402105|
|         Japan|2019|      3.5910855935|
|  Saudi Arabia|2015|       3.199530735|
|   New Zealand|2017|4.3087799995000005|
|       Denmark|2005|       4.575659142|
|     Australia|2013|      4.7601596245|
|       Hungary|2009|       3.615225522|
|       Bahrain|2019|       3.448275862|
|       Hungary|2017|       3.131879496|
|       Denmark|2007|      4.9528333665|
|           UAE|2013|      3.2670618905|
|        Brazil|2013|      5.4642979275|
+--------------+----+------------------+
only showing top 20 rows

Order of Operations
1) filter first to remove unnessary rows
2) then group
3) then aggregate
4) then select the columns for the final output
5) Then sort the rows

In [115]:
odf.filter(col("Price in US Dollars") > 3) \
   .groupBy("Year", "Country") \
   .agg(avg("Price in US Dollars").alias("Avg Price")) \
   .select("Country", "Year", "Avg Price") \
   .orderBy("Country", "Year") \
   .show()

+---------+----+-----------------+
|  Country|Year|        Avg Price|
+---------+----+-----------------+
|Argentina|2008|       3.64298725|
|Argentina|2009|      3.017382748|
|Argentina|2010|      3.558945027|
|Argentina|2011|       4.83968542|
|Argentina|2012|4.398784797999999|
|Argentina|2013|     3.8489259795|
|Argentina|2014|      3.034134008|
|Argentina|2015|       3.15858331|
|Argentina|2016|      3.347840643|
|Argentina|2017|     3.7969622305|
|Argentina|2018|       3.96039604|
|Argentina|2020|       3.50923244|
|Australia|2008|      3.362573099|
|Australia|2009|      3.372445411|
|Australia|2010|     3.9073938695|
|Australia|2011|      4.943724001|
|Australia|2012|     4.8083579995|
|Australia|2013|     4.7601596245|
|Australia|2014|     4.6438437495|
|Australia|2015|     4.1204849995|
+---------+----+-----------------+
only showing top 20 rows

In [117]:
odf.createOrReplaceTempView("bigmac")

In [ ]:
odf_sql = spark.sql("""
    SELECT Country, substr(Date, 1, 4) AS Year, AVG(CAST(`Price in US Dollars` AS FLOAT)) AS `Avg Price`
    FROM bigmac
    WHERE CAST(`Price in US Dollars` AS FLOAT) > 3
    GROUP BY Country, Year
    ORDER BY Year, Country
    """)

JOINS, JOINS, JOINS

In [174]:
sales_wk1 = spark.read.csv("C:/Users/erick/OneDrive/Desktop/python_work/pandas/Incomplete/restaurant_week_1_sales.csv", header=True, inferSchema=True) 
sales_wk1.show()
sales_wk2 = spark.read.csv("C:/Users/erick/OneDrive/Desktop/python_work/pandas/Incomplete/restaurant_week_2_sales.csv", header=True, inferSchema=True) 
sales_wk2.show()
items = spark.read.csv("C:/Users/erick/OneDrive/Desktop/python_work/pandas/Incomplete/restaurant_foods.csv", header=True, inferSchema=True) 
items.show()
customers = spark.read.csv("C:/Users/erick/OneDrive/Desktop/python_work/pandas/Incomplete/restaurant_customers.csv", header=True, inferSchema=True) 
customers.show()

+-----------+-------+
|Customer ID|Food ID|
+-----------+-------+
|        537|      9|
|         97|      4|
|        658|      1|
|        202|      2|
|        155|      9|
|        213|      8|
|        600|      1|
|        503|      5|
|         71|      3|
|        174|      3|
|        961|      9|
|        966|      5|
|        641|      4|
|        288|      2|
|        149|      4|
|        954|      2|
|        147|      9|
|        155|      1|
|        550|      6|
|        101|      7|
+-----------+-------+
only showing top 20 rows

+-----------+-------+
|Customer ID|Food ID|
+-----------+-------+
|        688|     10|
|        813|      7|
|        495|     10|
|        189|      5|
|        267|      3|
|        310|      5|
|        761|      2|
|        443|      5|
|        729|      9|
|        741|      8|
|        847|      6|
|        156|     10|
|        550|      7|
|        620|     10|
|        272|      4|
|        511|      2|
|          8|      6|
|        534|      7|
|        909|      6|
|        732|      9|
+-----------+-------+
only showing top 20 rows

+-------+----------+-----+
|Food ID| Food Item|Price|
+-------+----------+-----+
|      1|     Sushi| 3.99|
|      2|   Burrito| 9.99|
|      3|      Taco| 2.99|
|      4|Quesadilla| 4.25|
|      5|     Pizza| 2.49|
|      6|     Pasta|13.99|
|      7|     Steak|24.99|
|      8|     Salad|11.25|
|      9|     Donut| 0.99|
|     10|     Drink| 1.75|
+-------+----------+-----+

+---+----------+---------+------+-------------+--------------------+
| ID|First Name|Last Name|Gender|      Company|          Occupation|
+---+----------+---------+------+-------------+--------------------+
|  1|    Joseph|  Perkins|  Male|      Dynazzy|Community Outreac...|
|  2|  Jennifer|  Alvarez|Female|         DabZ|Senior Quality En...|
|  3|     Roger|    Black|  Male|      Tagfeed|   Account Executive|
|  4|    Steven|    Evans|  Male|         Fatz|    Registered Nurse|
|  5|      Judy| Morrison|Female|      Demivee|     Legal Assistant|
|  6|    Amanda|   Howell|Female|Thoughtbridge|    Dental Hygienist|
|  7|    Johnny|     Reid|  Male|  Babblestorm|   Account Executive|
|  8|   Frances|    Adams|Female|     Dabshots|       Developer III|
|  9|   Gregory|  Chapman|  Male|         Eayo|    Junior Executive|
| 10|    Steven|     Ryan|  Male|      Twinder|Community Outreac...|
| 11|   Michael| Reynolds|  Male|       Meevee|    Dental Hygienist|
| 12|      Lois|  Watkins|Female|         Mydo| Staff Accountant IV|
| 13|      Ruth|  Alvarez|Female|  Twitterlist|Mechanical System...|
| 14|      Adam|     Ryan|  Male|     Photojam|      Research Nurse|
| 15|     Jesse| Richards|  Male|      Demimbu|Chief Design Engi...|
| 16|     Scott|   Arnold|  Male|        Meemm|Human Resources A...|
| 17|      Ruby|   Palmer|Female|        Roomm|Administrative Of...|
| 18|     Jason|     King|  Male|      Flipbug|   Financial Advisor|
| 19|    Pamela|    Kelly|Female|        Jaloo|   Director of Sales|
| 20|      Lisa|     Rice|Female|         Oloo|       Programmer IV|
+---+----------+---------+------+-------------+--------------------+
only showing top 20 rows

In [175]:
#add week to table before we append
sales_wk1 = sales_wk1.withColumn("week", lit(1))
sales_wk1.show()
sales_wk2 = sales_wk2.withColumn("week", lit(2))
sales_wk2.show()
sales_wk1_wk2 = sales_wk1.union(sales_wk2)

+-----------+-------+----+
|Customer ID|Food ID|week|
+-----------+-------+----+
|        537|      9|   1|
|         97|      4|   1|
|        658|      1|   1|
|        202|      2|   1|
|        155|      9|   1|
|        213|      8|   1|
|        600|      1|   1|
|        503|      5|   1|
|         71|      3|   1|
|        174|      3|   1|
|        961|      9|   1|
|        966|      5|   1|
|        641|      4|   1|
|        288|      2|   1|
|        149|      4|   1|
|        954|      2|   1|
|        147|      9|   1|
|        155|      1|   1|
|        550|      6|   1|
|        101|      7|   1|
+-----------+-------+----+
only showing top 20 rows

+-----------+-------+----+
|Customer ID|Food ID|week|
+-----------+-------+----+
|        688|     10|   2|
|        813|      7|   2|
|        495|     10|   2|
|        189|      5|   2|
|        267|      3|   2|
|        310|      5|   2|
|        761|      2|   2|
|        443|      5|   2|
|        729|      9|   2|
|        741|      8|   2|
|        847|      6|   2|
|        156|     10|   2|
|        550|      7|   2|
|        620|     10|   2|
|        272|      4|   2|
|        511|      2|   2|
|          8|      6|   2|
|        534|      7|   2|
|        909|      6|   2|
|        732|      9|   2|
+-----------+-------+----+
only showing top 20 rows

In [162]:
sales_wk1.count()

250

In [163]:
sales_wk2.count()

250

In [164]:
sales_wk1_wk2.count()

500

In [172]:
sales_wk1_wk2.groupBy("Week").count().show()

+----+-----+
|Week|count|
+----+-----+
|   1|  250|
|   2|  250|
+----+-----+

In [183]:
join = (
    sales_wk1_wk2.join(items,sales_wk1_wk2["Food ID"] == items["Food ID"], "inner")
    .select(
        sales_wk1_wk2["Customer ID"], 
        sales_wk1_wk2["Food ID"], 
        items["Food Item"], 
        items["Price"])
)
join.show()

+-----------+-------+----------+-----+
|Customer ID|Food ID| Food Item|Price|
+-----------+-------+----------+-----+
|        537|      9|     Donut| 0.99|
|         97|      4|Quesadilla| 4.25|
|        658|      1|     Sushi| 3.99|
|        202|      2|   Burrito| 9.99|
|        155|      9|     Donut| 0.99|
|        213|      8|     Salad|11.25|
|        600|      1|     Sushi| 3.99|
|        503|      5|     Pizza| 2.49|
|         71|      3|      Taco| 2.99|
|        174|      3|      Taco| 2.99|
|        961|      9|     Donut| 0.99|
|        966|      5|     Pizza| 2.49|
|        641|      4|Quesadilla| 4.25|
|        288|      2|   Burrito| 9.99|
|        149|      4|Quesadilla| 4.25|
|        954|      2|   Burrito| 9.99|
|        147|      9|     Donut| 0.99|
|        155|      1|     Sushi| 3.99|
|        550|      6|     Pasta|13.99|
|        101|      7|     Steak|24.99|
+-----------+-------+----------+-----+
only showing top 20 rows

In [184]:
join = (sales_wk1_wk2.join(items,"Food ID") #same as above but less coding
    .select(sales_wk1_wk2["Customer ID"], sales_wk1_wk2["Food ID"], items["Food Item"], items["Price"])
)
join.show()

+-----------+-------+----------+-----+
|Customer ID|Food ID| Food Item|Price|
+-----------+-------+----------+-----+
|        537|      9|     Donut| 0.99|
|         97|      4|Quesadilla| 4.25|
|        658|      1|     Sushi| 3.99|
|        202|      2|   Burrito| 9.99|
|        155|      9|     Donut| 0.99|
|        213|      8|     Salad|11.25|
|        600|      1|     Sushi| 3.99|
|        503|      5|     Pizza| 2.49|
|         71|      3|      Taco| 2.99|
|        174|      3|      Taco| 2.99|
|        961|      9|     Donut| 0.99|
|        966|      5|     Pizza| 2.49|
|        641|      4|Quesadilla| 4.25|
|        288|      2|   Burrito| 9.99|
|        149|      4|Quesadilla| 4.25|
|        954|      2|   Burrito| 9.99|
|        147|      9|     Donut| 0.99|
|        155|      1|     Sushi| 3.99|
|        550|      6|     Pasta|13.99|
|        101|      7|     Steak|24.99|
+-----------+-------+----------+-----+
only showing top 20 rows

In [196]:
df_join = (
    sales_wk1_wk2.join(items,sales_wk1_wk2["Food ID"] == items["Food ID"], "inner")
                 .join(customers, sales_wk1_wk2["Customer ID"] == customers["ID"], "inner")
    .select(
        customers["ID"], 
        customers["First Name"],
        customers["Last Name"],
        sales_wk1_wk2["Food ID"], 
        items["Food Item"], 
        items["Price"])
)
join.show()

+---+----------+---------+-------+----------+-----+
| ID|First Name|Last Name|Food ID| Food Item|Price|
+---+----------+---------+-------+----------+-----+
|537|    Cheryl|  Carroll|      9|     Donut| 0.99|
| 97|    Amanda|  Watkins|      4|Quesadilla| 4.25|
|658|   Patrick|     Webb|      1|     Sushi| 3.99|
|202|     Louis| Campbell|      2|   Burrito| 9.99|
|155|   Carolyn|     Diaz|      9|     Donut| 0.99|
|213|     Keith|   Foster|      8|     Salad|11.25|
|600|    Sandra|   Bailey|      1|     Sushi| 3.99|
|503|    Justin|  Daniels|      5|     Pizza| 2.49|
| 71|   Carolyn|    Reyes|      3|      Taco| 2.99|
|174|      Anna|   Miller|      3|      Taco| 2.99|
|961|     Ralph| Richards|      9|     Donut| 0.99|
|966|    Robert|     Ford|      5|     Pizza| 2.49|
|641|     Donna|Gutierrez|      4|Quesadilla| 4.25|
|288|   Kenneth|  Jackson|      2|   Burrito| 9.99|
|149|  Jennifer|   Oliver|      4|Quesadilla| 4.25|
|954|    Thomas|  Perkins|      2|   Burrito| 9.99|
|147|   Theresa|  Morales|      9|     Donut| 0.99|
|155|   Carolyn|     Diaz|      1|     Sushi| 3.99|
|550|    Walter|   Miller|      6|     Pasta|13.99|
|101|    Jeremy|   Nelson|      7|     Steak|24.99|
+---+----------+---------+-------+----------+-----+
only showing top 20 rows

In [199]:
df_join.printSchema()

root
 |-- ID: integer (nullable = true)
 |-- First Name: string (nullable = true)
 |-- Last Name: string (nullable = true)
 |-- Food ID: integer (nullable = true)
 |-- Food Item: string (nullable = true)
 |-- Price: double (nullable = true)

In [217]:
sales_cust = df_join.groupBy("ID", "Last Name","First Name") \
                    .agg(sum("Price").alias("Revenue")) \
                    .select("ID", "Last Name","First Name","Revenue") \
                    .orderBy("ID") \
                    .show()

+---+---------+----------+------------------+
| ID|Last Name|First Name|           Revenue|
+---+---------+----------+------------------+
|  3|    Black|     Roger|              9.99|
|  8|    Adams|   Frances|             13.99|
| 10|     Ryan|    Steven|              9.99|
| 13|  Alvarez|      Ruth|              9.99|
| 20|     Rice|      Lisa|              3.99|
| 21|    Burns|    Albert|             12.75|
| 24|   Thomas|     Donna|             11.25|
| 26|    Kelly|  Michelle|              0.99|
| 27|  Bennett|   Jessica|              4.25|
| 30|    Hicks|    Pamela|             14.24|
| 35|  Chapman|    Nicole|             11.25|
| 38|   Flores|   Anthony|              4.25|
| 39| Harrison|    Teresa|              1.75|
| 45| Marshall|      Earl|36.239999999999995|
| 46|     Cole|      Adam|             13.99|
| 47|  Collins|    Louise|             11.25|
| 51|    Kelly|    Gloria|             11.74|
| 53| Phillips|      Ruby|              9.99|
| 54|    Berry|    Amanda|             11.25|
| 55|     Ford|     Ralph|              5.24|
+---+---------+----------+------------------+
only showing top 20 rows